{
  "views": {
    "login": {
      "modal": {
        "title": "Знайти випадкові дані користувача",
        "link": "Ви можете використовувати будь-які дані користувача з цього",
        "please": "Я зробив цей процес трохи простішим для вас, тому не соромтеся натиснути кнопку. Вона знайде один автоматично."
      }
    },
    "notFound": {
      "title": "Сторінку не знайдено",
      "message": "Сторінку не знайдено, здається, ви потрапили на неправильну сторінку"
    }
  },
  "dialogs": {
    "info": {
      "title": "Привіт, шановний гостю або потенційний роботодавець!",
      "p1": "Це невеликий демо-проект, створений не лише з цікавості, а й як швидка презентація моїх навичок. Я вирішив створити проект на базі відкритого коду та зібрати найбільш поширені функції, які може мати сучасна програма. Вони, можливо, не є найкращими, тому я відкритий для критики та зауважень, і я залишу посилання на репозиторій GitHub. Список функцій не є повним, і я буду додавати їх поетапно, якщо у мене буде час.",
      "p2": "Я - інженер з JavaScript з близько 9-річним досвідом у веб-розробці. Спочатку я починав свою кар'єру як розробник HTML/CSS. Ми працювали над різними лендінгами для сайтів на WordPress. Я навчився писати стилі з використанням препроцесора SASS, але я почав не любити WordPress. Після року роботи я вирішив покинути цю сферу, щоб мати більше часу для вивчення програмування. Оскільки я вже знаю, як писати стилі, я вирішив рухатися далі і вивчити JavaScript з використанням деяких сучасних інструментів.",
      "p3": "Я вивчив React, Node.js і Express протягом півроку і отримав посаду full-stack розробника в компанії під назвою WabbyLab. Ця компанія стала моїм домом на наступні кілька років. Я навчився писати правильний код та дотримуватися рекомендацій. Я навчився створювати API для своєї користувацької інтерфейсної частини, як створювати складні інтерфейси користувача та навіть як розгортати свою програму на віддаленому сервері. Я використовував React для розробки практично всього. Ми працювали над веб-додатками, десктопними додатками, а навіть мобільними додатками. Так, React Native був таким цікавим, що мені навіть довелося перетворити свій ноутбук Asus UX305FA на хакінтош, щоб мати змогу розробляти додатки для iOS.",
      "p4": "Але історія не закінчилася. Пізніше мою компанію продали, і я став віддаленим співробітником в іншій компанії, де я дізнався про Vue.js. Зараз у мене є приблизно 5 років досвіду використання Vue.js. Я закохався в цей інструмент з першого дня використання. Останні 2 роки я працюю в хорошій команді над проектом, пов'язаним з бетонною розрізкою. Моя відповідальність полягає у реалізації нових модулів та підтримці (рефакторингу) старих. Хоча цей проект був моїм першим виробничим досвідом з TypeScript, весь проект був дещо відрізняється від тих, над якими я працював раніше, через рішення попереднього розробника використовувати такі інструменти, як vuex-module-decorators та vue-property-decorator. Добре в тому, що я нарешті мав нагоду спробувати three.js. У минулому році я працював практично над тим самим додатком, але вже з Vue 3, TypeScript та Electron для планшета сканера.",
      "p5": "Після завершення проекту і нарешті, коли я був вільним, я вирішив створити демо-проект з демонстраційними цілями, щоб продемонструвати свої навички та інструменти, якими я люблю користуватися. Отже, ось ми! Це додаток Vue 3 з TypeScript. Я не використовував жодних компонентів бібліотек. Я не писав своєї власної API, але вирішив вибрати dummyJSON (https://dummyjson.com/), оскільки знайшов цей інструмент дуже зручним для початку роботи. Особливо якщо ви не є досвідченим розробником, цей інструмент може бути дійсно гарним способом практикувати використання різних API. Я знаю, що сьогодні новий тренд - використовувати Tailwind для написання стилів. Але я все ще вважаю, що немає нічого кращого за препроцесор SCSS, який використовується з методологією BEM."
    }
  },
  "modals": {
    "confirm": {
      "action": "Підтвердіть вашу дію",
      "text": "Ви впевнені, що хочете підтвердити дію?"
    }
  },
  "sidebar": {
    "logout": "Вийти",
    "dashboard": "Панель керування",
    "products": "Продукти",
    "users": "Користувачі",
    "github": "GitHub"
  },
  "actions": {
    "skip": "Пропустити",
    "next": "Далі",
    "start": "Почати",
    "login": "Увійти",
    "copy": "Копіювати",
    "close": "Закрити",
    "confirm": "Підтвердити",
    "decline": "Відмовитися",
    "findRandom": "Знайти випадкові дані",
    "addToCart": "Додати в кошик",
    "goToMain": "Перейти на головну сторінку"
  },
  "labels": {
    "username": "Ім'я користувача",
    "password": "Пароль"
  },
  "placeholders": {
    "username": "Введіть ваше ім'я користувача",
    "password": "Введіть пароль"
  },
  "notifications": {
    "login": {
      "copy": "Скопійовано в буфер обміну",
      "success": "Ви успішно увійшли в систему"
    },
    "user": {
      "successRemove": "Користувача успішно видалено",
      "errorRemove": "Виникла помилка"
    },
    "product": {
      "cartAdded": "{item} було додано до кошика",
      "favoritesAdded": "{item} було додано до списку обраного",
      "favoritesRemoved": "{item} було видалено зі списку обраного"
    }
  }
}
